## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 5 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                    |
|--------|----------------------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger`             |
|        | `aws_cloudwatch_event_target.api_end_to_end_test_lambda_trigger`           |
|        | `aws_cloudwatch_log_group.api_end_to_end_test`                             |
|        | `aws_lambda_function.api_end_to_end_test`                                  |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_api_end_to_end_test_lambda` |
| update | `aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger`             |
|        | `aws_cloudwatch_event_rule.form_archiver_lambda_trigger`                   |
|        | `aws_cloudwatch_event_rule.nagware_lambda_trigger`                         |
|        | `aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger`                 |
|        | `aws_cloudwatch_event_rule.response_archiver_lambda_trigger`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "api_end_to_end_test_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 9 AM UTC"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "api-end-to-end-test-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 9 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "audit_logs_archiver_lambda_trigger" {
      ~ description         = "Fires every day at 1am EST" -> "Fires every day at 6 AM UTC"
        id                  = "audit-logs-archiver-lambda-trigger"
        name                = "audit-logs-archiver-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.form_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "form_archiver_lambda_trigger" {
      ~ description         = "Fires every day at 4am EST" -> "Fires every day at 9 AM UTC"
        id                  = "form-archiver-lambda-trigger"
        name                = "form-archiver-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.nagware_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "nagware_lambda_trigger" {
      ~ description         = "Fires every day at 5am EST" -> "Fires every day at 10 AM UTC"
        id                  = "nagware-lambda-trigger"
        name                = "nagware-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "reliability_dlq_lambda_trigger" {
      ~ description         = "Fires every day at 2am EST" -> "Fires every day at 7 AM UTC"
        id                  = "reliability-dlq-lambda-trigger"
        name                = "reliability-dlq-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.response_archiver_lambda_trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "response_archiver_lambda_trigger" {
      ~ description         = "Fires every day at 3am EST" -> "Fires every day at 8 AM UTC"
        id                  = "response-archiver-lambda-trigger"
        name                = "response-archiver-lambda-trigger"
        tags                = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.api_end_to_end_test_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "api_end_to_end_test_lambda_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "api-end-to-end-test-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.api_end_to_end_test will be created
  + resource "aws_cloudwatch_log_group" "api_end_to_end_test" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/API_End_To_End_Test"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_lambda_function.api_end_to_end_test will be created
  + resource "aws_lambda_function" "api_end_to_end_test" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "api-end-to-end-test"
      + id                             = (known after apply)
      + image_uri                      = "test_url:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_PRIVATE_KEY"        = (sensitive value)
              + "API_URL"                = "http://forms-api.ecs.local:3001"
              + "FORM_ID"                = "cmacoc5ga0001yk01zgn888l9"
              + "IDP_PROJECT_IDENTIFIER" = "275372254274006635"
              + "IDP_URL"                = "http://zitadel.ecs.local:8080"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/API_End_To_End_Test"
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-06651d69cd4d3c50f",
            ]
          + subnet_ids                  = [
              + "subnet-07e38df0760d389d1",
              + "subnet-07f9debd31e48ce64",
              + "subnet-0af8e6e3cf80f582d",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_api_end_to_end_test_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_api_end_to_end_test_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "api-end-to-end-test"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

Plan: 5 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  + lambda_api_end_to_end_test_log_group_name      = "/aws/lambda/API_End_To_End_Test"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_end_to_end_test"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN -...
```

</details>
